###  Results for `terraform plan` on `dev` 

<details>
<summary>Show output</summary>

```diff
data.aws_ssm_parameter.subnet_public_1c: Reading...
data.aws_ssm_parameter.subnet_public_1b: Reading...
data.aws_ssm_parameter.subnet_public_1a: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:354040364707:cluster/ecs-cluster]
data.aws_ssm_parameter.subnet_private_1b: Reading...
data.aws_ssm_parameter.vpc: Reading...
aws_iam_role.main: Refreshing state... [id=ecs-cluster-instance-profile]
data.aws_ssm_parameter.subnet_private_1c: Reading...
data.aws_ssm_parameter.subnet_private_1a: Reading...
data.aws_ssm_parameter.subnet_private_1c: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1c]
data.aws_ssm_parameter.vpc: Read complete after 0s [id=/arq-EKS/vpc/vpc_id]
aws_security_group.main: Refreshing state... [id=sg-048a98c7990f1b89e]
aws_security_group.lb: Refreshing state... [id=sg-04dc45587a9e3974a]
data.aws_ssm_parameter.subnet_public_1b: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1b]
data.aws_ssm_parameter.subnet_private_1a: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1a]
data.aws_ssm_parameter.subnet_public_1c: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1c]
data.aws_ssm_parameter.subnet_private_1b: Read complete after 0s [id=/arq-EKS/vpc/subnet_private_1b]
data.aws_ssm_parameter.subnet_public_1a: Read complete after 0s [id=/arq-EKS/vpc/subnet_public_1a]
aws_iam_role_policy_attachment.ec2_ssm: Refreshing state... [id=ecs-cluster-instance-profile-20240921175140623100000001]
aws_iam_role_policy_attachment.ec2_role: Refreshing state... [id=ecs-cluster-instance-profile-20240921175140701500000002]
aws_iam_instance_profile.main: Refreshing state... [id=ecs-cluster-instance-profile]
aws_security_group_rule.subnet_ranges: Refreshing state... [id=sgrule-3691360889]
aws_security_group_rule.ingress_80: Refreshing state... [id=sgrule-3935459141]
aws_security_group_rule.ingress_443: Refreshing state... [id=sgrule-3726833527]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:354040364707:loadbalancer/app/ecs-cluster-ingress/efac95243cf646ac]
aws_launch_template.on_demand: Refreshing state... [id=lt-0de20a64583726cf2]
aws_launch_template.spots: Refreshing state... [id=lt-0bb63cc2b84c20a4d]
aws_autoscaling_group.spots: Refreshing state... [id=ecs-cluster-spots20240921175142092600000008]
aws_autoscaling_group.on_demand: Refreshing state... [id=ecs-cluster-on-demand20240921175142089700000007]
aws_lb_listener.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:354040364707:listener/app/ecs-cluster-ingress/efac95243cf646ac/22e8e51c3d60b8fe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.on_demand must be replaced
-/+ resource "aws_autoscaling_group" "on_demand" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:354040364707:autoScalingGroup:b07ed8c8-a28c-47d9-838e-6fdd8e84629d:autoScalingGroupName/ecs-cluster-on-demand20240921175142089700000007" -> (known after apply)
      ~ availability_zones               = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "ecs-cluster-on-demand20240921175142089700000007" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ name                             = "ecs-cluster-on-demand20240921175142089700000007" -> (known after apply)
      ~ name_prefix                      = "ecs-cluster-on-demand" -> "cluster-on-demand" # forces replacement
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::354040364707:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0de20a64583726cf2" -> (known after apply)
          ~ name    = "ecs-cluster-on-demand20240921175141884000000005" -> (known after apply)
          ~ version = "1" -> (known after apply)
        }

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "ecs-cluster-on-demand" -> null
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "cluster-on-demand"
        }

        # (1 unchanged block hidden)
    }

  # aws_autoscaling_group.spots must be replaced
-/+ resource "aws_autoscaling_group" "spots" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:354040364707:autoScalingGroup:0c243e6a-c4c6-40a7-8d6c-4ab9347cb9ba:autoScalingGroupName/ecs-cluster-spots20240921175142092600000008" -> (known after apply)
      ~ availability_zones               = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "ecs-cluster-spots20240921175142092600000008" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ name                             = "ecs-cluster-spots20240921175142092600000008" -> (known after apply)
      ~ name_prefix                      = "ecs-cluster-spots" -> "cluster-spots" # forces replacement
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::354040364707:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0bb63cc2b84c20a4d" -> (known after apply)
          ~ name    = "ecs-cluster-spots20240921175141881700000003" -> (known after apply)
          ~ version = "1" -> (known after apply)
        }

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "ecs-cluster-spots" -> null
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "cluster-spots"
        }

        # (1 unchanged block hidden)
    }

  # aws_ecs_capacity_provider.on_demand will be created
  + resource "aws_ecs_capacity_provider" "on_demand" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "cluster-on-demand"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 10
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 90
            }
        }
    }

  # aws_ecs_capacity_provider.spots will be created
  + resource "aws_ecs_capacity_provider" "spots" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "cluster-spots"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 10
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 90
            }
        }
    }

  # aws_ecs_cluster.main must be replaced
-/+ resource "aws_ecs_cluster" "main" {
      ~ arn      = "arn:aws:ecs:us-east-1:354040364707:cluster/ecs-cluster" -> (known after apply)
      ~ id       = "arn:aws:ecs:us-east-1:354040364707:cluster/ecs-cluster" -> (known after apply)
      ~ name     = "ecs-cluster" -> "cluster" # forces replacement
      - tags     = {} -> null
      ~ tags_all = {} -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_ecs_cluster_capacity_providers.main will be created
  + resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "cluster-on-demand",
          + "cluster-spots",
        ]
      + cluster_name       = "cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "cluster-on-demand"
          + weight            = 100
        }
    }

  # aws_iam_instance_profile.main must be replaced
-/+ resource "aws_iam_instance_profile" "main" {
      ~ arn         = "arn:aws:iam::354040364707:instance-profile/ecs-cluster-instance-profile" -> (known after apply)
      ~ create_date = "2024-09-21T17:51:40Z" -> (known after apply)
      ~ id          = "ecs-cluster-instance-profile" -> (known after apply)
      ~ name        = "ecs-cluster-instance-profile" -> "cluster-instance-profile" # forces replacement
      + name_prefix = (known after apply)
      ~ role        = "ecs-cluster-instance-profile" -> "cluster-instance-profile"
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
      ~ unique_id   = "AIPAVE3TTH2R2GZJ2RD5Z" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.main must be replaced
-/+ resource "aws_iam_role" "main" {
      ~ arn                   = "arn:aws:iam::354040364707:role/ecs-cluster-instance-profile" -> (known after apply)
      ~ create_date           = "2024-09-21T17:51:40Z" -> (known after apply)
      ~ id                    = "ecs-cluster-instance-profile" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM",
        ] -> (known after apply)
      ~ name                  = "ecs-cluster-instance-profile" -> "cluster-instance-profile" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAVE3TTH2RW4KQ6BRYR" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.ec2_role must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ec2_role" {
      ~ id         = "ecs-cluster-instance-profile-20240921175140701500000002" -> (known after apply)
      ~ role       = "ecs-cluster-instance-profile" -> "cluster-instance-profile" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.ec2_ssm must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ec2_ssm" {
      ~ id         = "ecs-cluster-instance-profile-20240921175140623100000001" -> (known after apply)
      ~ role       = "ecs-cluster-instance-profile" -> "cluster-instance-profile" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_launch_template.on_demand must be replaced
-/+ resource "aws_launch_template" "on_demand" {
      ~ arn                     = "arn:aws:ec2:us-east-1:354040364707:launch-template/lt-0de20a64583726cf2" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "lt-0de20a64583726cf2" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
      ~ name                    = "ecs-cluster-on-demand20240921175141884000000005" -> (known after apply)
      ~ name_prefix             = "ecs-cluster-on-demand" -> "cluster-on-demand" # forces replacement
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ tags_all                = {} -> (known after apply)
      ~ user_data               = "IyEvYmluL2Jhc2gKCmVjaG8gRUNTX0NMVVNURVI9ZWNzLWNsdXN0ZXIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwo=" -> "IyEvYmluL2Jhc2gKCmVjaG8gRUNTX0NMVVNURVI9Y2x1c3RlciA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCg=="
      ~ vpc_security_group_ids  = [
          - "sg-048a98c7990f1b89e",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ block_device_mappings {
            # (1 unchanged attribute hidden)

          ~ ebs {
              ~ iops        = 0 -> (known after apply)
              ~ throughput  = 0 -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

      ~ iam_instance_profile {
          ~ name = "ecs-cluster-instance-profile" -> "cluster-instance-profile"
        }

      ~ tag_specifications {
          ~ tags          = {
              ~ "Name" = "ecs-cluster-on-demand" -> "cluster-on-demand"
            }
            # (1 unchanged attribute hidden)
        }
    }

  # aws_launch_template.spots must be replaced
-/+ resource "aws_launch_template" "spots" {
      ~ arn                     = "arn:aws:ec2:us-east-1:354040364707:launch-template/lt-0bb63cc2b84c20a4d" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "lt-0bb63cc2b84c20a4d" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
      ~ name                    = "ecs-cluster-spots20240921175141881700000003" -> (known after apply)
      ~ name_prefix             = "ecs-cluster-spots" -> "cluster-spots" # forces replacement
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ tags_all                = {} -> (known after apply)
      ~ user_data               = "IyEvYmluL2Jhc2gKCmVjaG8gRUNTX0NMVVNURVI9ZWNzLWNsdXN0ZXIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwo=" -> "IyEvYmluL2Jhc2gKCmVjaG8gRUNTX0NMVVNURVI9Y2x1c3RlciA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCg=="
      ~ vpc_security_group_ids  = [
          - "sg-048a98c7990f1b89e",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ block_device_mappings {
            # (1 unchanged attribute hidden)

          ~ ebs {
              ~ iops        = 0 -> (known after apply)
              ~ throughput  = 0 -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

      ~ iam_instance_profile {
          ~ name = "ecs-cluster-instance-profile" -> "cluster-instance-profile"
        }

      ~ instance_market_options {
            # (1 unchanged attribute hidden)

          ~ spot_options {
              - block_duration_minutes = 0 -> null
              + valid_until            = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ tag_specifications {
          ~ tags          = {
              ~ "Name" = "ecs-cluster-on-demand" -> "cluster-on-demand"
            }
            # (1 unchanged attribute hidden)
        }
    }

  # aws_lb.main must be replaced
-/+ resource "aws_lb" "main" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:us-east-1:354040364707:loadbalancer/app/ecs-cluster-ingress/efac95243cf646ac" -> (known after apply)
      ~ arn_suffix                                                   = "app/ecs-cluster-ingress/efac95243cf646ac" -> (known after apply)
      ~ dns_name                                                     = "ecs-cluster-ingress-657284732.us-east-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing                             = true -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:us-east-1:354040364707:loadbalancer/app/ecs-cluster-ingress/efac95243cf646ac" -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
      ~ name                                                         = "ecs-cluster-ingress" -> "cluster-ingress" # forces replacement
      + name_prefix                                                  = (known after apply)
      ~ security_groups                                              = [
          - "sg-04dc45587a9e3974a",
        ] -> (known after apply)
      - tags                                                         = {} -> null
      ~ tags_all                                                     = {} -> (known after apply)
      ~ vpc_id                                                       = "vpc-023eb259c34f863b2" -> (known after apply)
      ~ zone_id                                                      = "Z35SXDOTRQ7X7K" -> (known after apply)
        # (14 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-00bd8c623095c0227" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-083d32b3652e32a45" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0d5a73324770591a3" -> null
        }
    }

  # aws_lb_listener.main must be replaced
-/+ resource "aws_lb_listener" "main" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:354040364707:listener/app/ecs-cluster-ingress/efac95243cf646ac/22e8e51c3d60b8fe" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:354040364707:listener/app/ecs-cluster-ingress/efac95243cf646ac/22e8e51c3d60b8fe" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:354040364707:loadbalancer/app/ecs-cluster-ingress/efac95243cf646ac" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order = 1 -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_security_group.lb must be replaced
-/+ resource "aws_security_group" "lb" {
      ~ arn                    = "arn:aws:ec2:us-east-1:354040364707:security-group/sg-04dc45587a9e3974a" -> (known after apply)
      ~ id                     = "sg-04dc45587a9e3974a" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Liberando trafego na porta 443"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Liberando trafego na porta 80"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ name                   = "ecs-cluster-load-balancer" -> "cluster-load-balancer" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "354040364707" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.main must be replaced
-/+ resource "aws_security_group" "main" {
      ~ arn                    = "arn:aws:ec2:us-east-1:354040364707:security-group/sg-048a98c7990f1b89e" -> (known after apply)
      ~ id                     = "sg-048a98c7990f1b89e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Liberando trafego para a VPC"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "ecs-cluster" -> "cluster" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "354040364707" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_security_group_rule.ingress_443 must be replaced
-/+ resource "aws_security_group_rule" "ingress_443" {
      ~ id                       = "sgrule-3726833527" -> (known after apply)
      ~ security_group_id        = "sg-04dc45587a9e3974a" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-02a9573b218c47b32" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.ingress_80 must be replaced
-/+ resource "aws_security_group_rule" "ingress_80" {
      ~ id                       = "sgrule-3935459141" -> (known after apply)
      ~ security_group_id        = "sg-04dc45587a9e3974a" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-057204118ba41ba7e" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.subnet_ranges must be replaced
-/+ resource "aws_security_group_rule" "subnet_ranges" {
      ~ id                       = "sgrule-3691360889" -> (known after apply)
      ~ security_group_id        = "sg-048a98c7990f1b89e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0a18455f4f8fd145f" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 19 to add, 0 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>